<?php
function generate_fake_news($count = 10)
{
	for ($i = 1; $i <= $count; $i++) {
		wp_insert_post([
			'post_type'    => 'post',
			'post_status'  => 'publish',
			'post_title'   => 'Тестовая новость ' . $i,
			'post_content' => 'Тестовый текст для новости ' . $i . '. Здесь может быть ваш контент Здесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контентЗдесь может быть ваш контент',
			'post_category' => [get_cat_ID('Новости')],
		]);
	}
}
add_action('init', function () {
	if (isset($_GET['generate_news'])) {
		generate_fake_news(20);
		echo 'Новости сгенерированы!';
		exit;
	}
});

?>