<section class="company-info">
	<div class="container">
		<div class="top">
			<h2 class="h2">О компании</h2>
		</div>
		<div class="company-info__content">
			<div class="company-info__image">
				<img src="<?php echo get_template_directory_uri(); ?>/assets/img/about-page/company-info/1.jpg" alt="Резка трубы">
				<div class="pattern"></div>
			</div>
			<div class="company-info__text-block">
				<div class="company-info__heading">
					<h3 class="h3">«металлобаза Ивтент» — комплексный поставщик металлопроката, работаем на рынке с 2001 года</h3>
				</div>
				<div class="company-info__text">
					<p>«Металлобаза Ивтент» реализует металлопрокат в городе Иваново для нужд промышленных и строительных организаций.</p>
					<p>Cвязаны долгосрочными контрактами с ведущими российскими предприятиями, изготавливающими металлопродукцию, что позволяет нашим заказчикам купить металлопрокат оптом и в розницу по действительно низким ценам.</p>
					<p>Наши специалисты помогут подобрать оптимальные решения для ваших задач, рассчитают необходимое количество материалов и оформят заказ в кратчайшие сроки.</p>
					<p>Гарантируем качество, надёжные поставки и индивидуальный подход к каждому заказчику!</p>
				</div>
			</div>
		</div>
	</div>
</section>